Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Returns the maximum value that can be returned by a call to mt_rand().
pt_br: Retorna o maior valor que pode ser obtido numa chamada a mt_rand().

source: See also mt_rand(), mt_srand() and getrandmax().
pt_br: Veja também mt_rand(), mt_srand() e getrandmax().

source: Many random number generators of older libcs have dubious or unknown characteristics and are slow.
pt_br: Descrição

source: By default, PHP uses the libc random number generator with the rand() By default, PHP uses the libc random number generator with the rand() function.
pt_br: Por default, o PHP utiliza o gerador de números aleatórios da libc para a função rand().

source: The mt_rand() function is a drop-in replacement for this.
pt_br: A função mt_rand() é um bom substituto para a primeira.

source: It uses a random number generator with known characteristics using the Mersenne Twister, which will produce random numbers that should be suitable for seeding some kinds of cryptography (see the home page for details) and is four times faster than what the average libc provides.
pt_br: Ela utiliza um gerador de números aleatórios com características conhecidas, o Mersenne Twister, que produzirá números randômicos que podem ser utilizados como sementes em alguns tipos de criptografia e é em média quatro vezes mais rápido do que o fornecido pela libc.

source: If you want a random number between 5 and 15 (inclusive), for example, use mt_rand (5, 15).
pt_br: Se chamada sem os argumentos opcionais min e max, mt_rand() retorna um pseudo número aletório enrte 0 e RAND_MAX. se você precisa de um número randômico entre 5 e 15 (inclusive), por exemplo, utilize mt_rand (5, 15).

source: In older versions of PHP, you had to seed the random number generator before use with mt_srand().
pt_br: Em versões anteriores do PHP, você tem que semear o gerador de números randômicos primerio com mt_srand().

source: Since 4.2.0 this is no longer necessary.
pt_br: Desde o PHP 4.2.0, isto não é mais necessário.

source: In versions before 3.0.7 the meaning of max was range.
pt_br: Em versões anteriores a 3.0.7, o significado do parâmetro max era range.

source: To get the same results in these versions the short example should be mt_rand (5, 11) to get a random number between 5 and 15.
pt_br: Assim, para obter os mesmos resultados do exemplo acima, você precisaria utilizar rand (5, 11) para obter um número aleatório entre 5 e 15.

source: See also mt_srand(), mt_getrandmax() and rand().
pt_br: Veja também mt_srand(), mt_getrandmax() e rand().

source: Seeds the random number generator with seed.
pt_br: Deszcrição

source: / / seed with microseconds function make_seed() {list($usec, $sec) = explode( '', microtime()); return (float) $sec + ((float) $usec * 100000);} mt_srand(make_seed()); $randval = mt_rand();
pt_br: / / semente de microsegundos function make_seed() {list($usec, $sec) = explode( '', microtime()); return (float) $sec + ((float) $usec * 100000);} mt_srand(make_seed()); $randval = mt_rand();

source: Since PHP 4.2.0 it 's no longer necessary to seed the random number generator before using it.
pt_br: Desde o PHP 4.2.0 não é mais necessário semear o gerador de números aleatórios antes de usá-lo.

source: See also mt_rand(), mt_getrandmax() and srand().
pt_br: Veja também mt_rand(), mt_getrandmax() e srand().

source: (4.0.5 - 4.2.3 only)
pt_br: muscat_close

source: mysql_affected_rows() returns the number of rows affected by the last INSERT, UPDATE or DELETE query associated with link_identifier.
pt_br: mysql_affected_rows() retorna o número de linhas afetadas pela ultima query INSERT, UPDATE ou DELETE associada a link_identifier.

source: If the link identifier isn' t specified, the last link opened by mysql_connect() is assumed.
pt_br: Se o identificador de link não é especificado, o ultimo link aberto por mysql_connect() é utilizado.

source: If you are using transactions, you need to call mysql_affected_rows() after your INSERT, UPDATE, or DELETE query, not after the commit.
pt_br: Se você esta usando transações, você deve chamar mysql_affected_rows() após sua query INSERT, UPDATE, ou DELETE, não depois de commit.

source: If the last query was a DELETE query with no WHERE clause, all of the records will have been deleted from the table but this function will return zero.
pt_br: Se a ultima query foi um DELETE sem a cláusula WHERE, todos os registros foram apagados da tabela, mas esta função retornará zero.

source: When using UPDATE, MySQL will not update columns where the new value is the same as the old value.
pt_br: Quando usando UPDATE, o MySQL não atualizará as colunas onde o novo valor é o mesmo que o valor anterior.

source: This creates the possiblity that mysql_affected_rows() may not actually equal the number of rows matched, only the number of rows that were literally affected by the query.
pt_br: Isto cria a possibilidade de que a função mysql_affected_rows() não seja atualmente igual ao número de linhas encontradas, somente o número de linhas que literalmente foram afetadas pela query.

source: mysql_affected_rows() does not work with SELECT statements; only on statements which modify records.
pt_br: A função mysql_affected_rows() A função mysql_affected_rows() não funciona com os comandos SELECT; somente comandos que modificam os registros.

source: To retrieve the number of rows returned by a SELECT, use mysql_num_rows().
pt_br: Para pegar o número de linhas retornados por SELECT, use mysql_num_rows().

source: If the last query failed, this function will return -1.
pt_br: Se a ultima query falhou, esta função irá retornar -1.

source: ?php / * connect to database * / mysql_pconnect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); / * this should return the correct numbers of deleted records * / mysql_query("DELETE FROM mytable WHERE id 10"); printf ("Records deleted: %d\n", mysql_affected_rows()); / * without a where clause in a delete statement, it should return 0 * / mysql_query("DELETE FROM mytable"); printf ("Records deleted: %d\n", mysql_affected_rows());?
pt_br: ?php / * Conecta com o banco de dados * / mysql_pconnect( "localhost", "mysql_user", "mysql_password") or die ("Não pude conectar: ". mysql_error()); / * Este deve retornar o número coreto de registros excluídos * / mysql_query("DELETE FROM mytable WHERE id 10"); printf ("Registros excluídos: %d\n", mysql_affected_rows()); / * Sem a clausula where no comando delete, deve retornar 0 * / mysql_query("DELETE FROM mytable"); printf ("Registros excluídos: %d\n", mysql_affected_rows());?

source: The above example would produce the following output:
pt_br: O exemplo acima deve produzir a seguinte saída:

source: Records deleted:
pt_br: Registros excluídos:

source: 10 Records deleted:
pt_br: 10 Registros excluídos:

source: ?php / * connect to database * / mysql_pconnect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); / * Update records * / mysql_query("UPDATE mytable SET used=1 WHERE id 10"); printf ("Updated records: %d\n", mysql_affected_rows()); mysql_query("COMMIT");?
pt_br: ?php / * conecta com o banco de dados * / mysql_pconnect( "localhost", "mysql_user", "mysql_password") or die ("Não pude conectar: ". mysql_error()); / * Atualiza os registros * / mysql_query("UPDATE mytable SET used=1 WHERE id 10"); printf ("Registros atualizados: %d\n", mysql_affected_rows()); mysql_query("COMMIT");?

source: Updated Records:
pt_br: Registros atualizados:

source: See also: mysql_num_rows(), mysql_info().
pt_br: Veja também: mysql_num_rows(), mysql_info().

source: mysql_change_user() changes the logged in user of the current active connection, or the connection given by the optional link_identifier parameter.
pt_br: A função mysql_change_user() muda o usuário logado da conexão ativa atual, ou da conexão dada pelo parâmetro opcional link_identifier.

source: If a database is specified, this will be the current database after the user has been changed.
pt_br: Se um banco de dados é especificado, este será o banco de dados atual depois que mudar de usuário.

source: If the new user and password authorization fails, the current connected user stays active.
pt_br: Se houver erro na troca de usuário o que esta atualmente conectado permanece como o usuário ativo.

source: This function was introduced in PHP 3.0.13 and requires MySQL 3.23.3 or higher.
pt_br: Esta função foi introduzida no PHP 3.0.13 e requer MySQL 3.23.3 ou superior.

source: It is not available in PHP 4.
pt_br: Ela não esta disponível no PHP 4.

source: mysql_client_encoding() returns the default character set name for the current connection.
pt_br: A função mysql_client_encoding() retorna o conjunto de caracteres padrão para a conexão atual.

source: Example 1. mysql_client_encoding() example
pt_br: Exemplo mysql_client_encoding()

source: ?php $link = mysql_connect( 'localhost', 'mysql_user', 'mysql_password'); $charset = mysql_client_encoding($link); printf ("current character set is %s\n", $charset);?
pt_br: ?php $link = mysql_connect( 'localhost', 'mysql_user', 'mysql_password'); $charset = mysql_client_encoding($link); printf ("Conjunto atual de caracteres é %s\n", $charset);?

source: current character set is latin1
pt_br: Conjunto atual de caracteres é latin1

source: See also: mysql_real_escape_string()
pt_br: Veja também: mysql_real_escape_string()

source: mysql_close() closes the connection to the MySQL server that's associated with the specified link identifier.
pt_br: A função mysql_close() fecha a conexão com o servidor MySQL que você referir com o link_identifier.

source: If link_identifier isn 't specified, the last opened link is used.
pt_br: Se o parâmetro link_identifier não é especificado a ultima conexão aberta é usada.

source: Using mysql_close() isn't usually necessary, as non-persistent open links are automatically closed at the end of the script's execution.
pt_br: Usar a função mysql_close() não é atualmente necessário, porque conexões não persistentes são automaticamente fechadas ao final da execução do script.

source: See also freeing resources.
pt_br: Veja também freeing resources.

source: MySQL close example
pt_br: Exemplo MySQL close

source: ?php $link = mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); print ("Connected successfully"); mysql_close($link);?
pt_br: ?php $link = mysql_connect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); print ("Conectado !"); mysql_close($link);?

source: See also: mysql_connect(), and mysql_pconnect().
pt_br: Veja também: mysql_connect(), e mysql_pconnect().

source: Returns a MySQL link identifier on success, or FALSE on failure.
pt_br: Descrição

source: mysql_connect() establishes a connection to a MySQL server.
pt_br: Retorna um identificador de link (link_identifier) com o MySQL se der certo, ou FALSE se falhar.

source: The following defaults are assumed for missing optional parameters: server = 'localhost:3306', username = name of the user that owns the server process and password = empty password.
pt_br: Os seguintes padrões são assumidos para os argumentos opcionais que estiverem faltando: server = 'localhost:3306', username = nome do usuário dono do processo do servidor, password = senha vazia.

source: The server parameter can also include a port number. eg. "hostname:port" or a path to a socket eg. ": / path / to / socket" for the localhost.
pt_br: Exemplo: "hostname:port" ou um caminho para um socket, exemplo. ": / path / to / socket" para o servidor local (localhost).

source: Support for ":port" was added in PHP 3.0B4.
pt_br: Suporte para ":port" foi adicionado no PHP 3.0B4.

source: Support for ": / path / to / socket" was added in PHP 3.0.10.
pt_br: Suporte para ": / path / to / socket" foi adicionado no PHP 3.0.10.

source: You can suppress the error message on failure by prepending a @ to the function name.
pt_br: Você pode suprimir a mensagem de erro em caso de falha colocando um @ antes do nome da função.

source: If a second call is made to mysql_connect() with the same arguments, no new link will be established, but instead, the link identifier of the already opened link will be returned.
pt_br: Se uma segunda chamada é feita para mysql_connect() com os mesmos argumentos, um novo link não será estabelecido, mas ao invés disto o identificador da conexão já aberta será retornado.

source: The new_link parameter modifies this behavior and makes mysql_connect() always open a new link, even if mysql_connect() was called before with the same parameters.
pt_br: O parâmetro new_link modifica esta opção e faz com que a função mysql_connect() sempre abra um novo link, mesmo que mysql_connect() seja chamada com os mesmos parâmetros.

source: The client_flags parameter can be a combination of the constants MYSQL_CLIENT_SSL, MYSQL_CLIENT_COMPRESS, MYSQL_CLIENT_IGNORE_SPACE or MYSQL_CLIENT_INTERACTIVE.
pt_br: O parâmetro client_flags pode ser uma combinação das constantes MYSQL_CLIENT_SSL, MYSQL_CLIENT_COMPRESS, MYSQL_CLIENT_IGNORE_SPACE ou MYSQL_CLIENT_INTERACTIVE.

source: The new_link parameter became available in PHP 4.2.0
pt_br: O parâmetro new_link tornou-se disponível no PHP 4.2.0

source: The client_flags parameter became available in PHP 4.3.0
pt_br: O parâmetro client_flags tornou-se disponível no PHP 4.3.0

source: The link to the server will be closed as soon as the execution of the script ends, unless it' s closed earlier by explicitly calling mysql_close().
pt_br: O link com o servidor será fechado tão logo a execução do script termine, se não tiver sido fechado anteriormente por chamar explicita à mysql_close().

source: MySQL connect example
pt_br: Exemplo de conexão MySQL

source: See also mysql_pconnect() and mysql_close().
pt_br: Veja também mysql_pconnect() e mysql_close().

source: mysql_create_db() attempts to create a new database on the server associated with the specified link identifier.
pt_br: mysql_create_db() tenta criar um novo banco de dados no servidor especificado pelo identificador de link (link_identifier) indicado.

source: MySQL create database example
pt_br: Exemplo MySQL create database

source: ?php $link = mysql_pconnect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); if (mysql_create_db("my_db")) {print ("Database created successfully\n");} else {printf ("Error creating database: %s\n", mysql_error());}?
pt_br: ?php $link = mysql_pconnect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); if (mysql_create_db("my_db")) {print ("Banco de dados criado\n");} else {printf ("Erro criando o banco de dados: %s\n", mysql_error());}?

source: For downwards compatibility mysql_createdb() can also be used.
pt_br: Para compatibilidade com versões anteriores mysql_createdb() também pode ser usada.

source: This is deprecated, however.
pt_br: Em todo o caso ela esta obsoleta.

source: The function mysql_create_db() is deprecated.
pt_br: A função mysql_create_db() está obsoleta.

source: It is preferable to use mysql_query() to issue a SQL CREATE DATABASE Statement instead.
pt_br: É preferível usar mysql_query() para fazer o comando SQL CREATE DATABASE.

source: See also: mysql_drop_db(), mysql_query().
pt_br: Veja também: mysql_drop_db(), mysql_query().

source: mysql_data_seek() moves the internal row pointer of the MySQL result associated with the specified result identifier to point to the specified row number.
pt_br: mysql_data_seek() move o ponteiro interno do resultado MySQL associado ao identificador de resultado (result_identifier) especificado para apontar a linha identificada.

source: The next call to mysql_fetch_row() would return that row.
pt_br: A próxima chamada a mysql_fetch_row() irá retornar esta linha.

source: Row_number starts at 0.
pt_br: O parâmetro row_number O parâmetro row_number (número de linha) começa no 0.

source: The row_number should be a value in the range from 0 to mysql_num_rows - 1.
pt_br: O row_number deve ser um valor entre 0 e mysql_num_rows - 1.

source: The function mysql_data_seek() can be used in conjunction only with mysql_query(), not with mysql_unbuffered_query().
pt_br: A função mysql_data_seek() pode ser usada somente em conjunto com mysql_query(), não com mysql_unbuffered_query().

source: MySQL data seek example
pt_br: Exemplo MySQL data seek

source: ?php $link = mysql_pconnect( "localhost", "mysql_user", "mysql_password") or die("Could not connect: ". mysql_error()); mysql_select_db("samp_db") or die("Could not select database:". mysql_error()); $query = "SELECT last_name, first_name FROM friends"; $result = mysql_query($query) or die("Query failed: ". mysql_error()); / * fetch rows in reverse order * / for ($i = mysql_num_rows($result) - 1; $i = 0; $i- -) {if (!mysql_data_seek($result, $i)) {echo "Cannot seek to row $i:". mysql_error(). "\n"; continue;} if( !($row = mysql_fetch_object($result))) continue; echo "$row - last_name $row - first_name br / \n";} mysql_free_result($result);?
pt_br: ?php $link = mysql_pconnect( "localhost", "mysql_user", "mysql_password") or die("Não pude conectar: ". mysql_error()); mysql_select_db("samp_db") or die("Não pude selecionar o banco de dados:". mysql_error()); $query = "SELECT last_name, first_name FROM friends"; $result = mysql_query($query) or die("Query falhou: ". mysql_error()); / * fetch rows in reverse order * / for ($i = mysql_num_rows($result) - 1; $i = 0; $i- -) {if (!mysql_data_seek($result, $i)) {echo "Não pude ir para a linha $i:". mysql_error(). "\n"; continue;} if( !($row = mysql_fetch_object($result))) continue; echo "$row - last_name $row - first_name br / \n";} mysql_free_result($result);?

source: See also: mysql_query(), mysql_num_rows().
pt_br: Veja também: mysql_query() e mysql_num_rows().

source: mysql_db_name() takes as its first parameter the result pointer from a call to mysql_list_dbs().
pt_br: mysql_db_name() tem como primeiro parâmetro o resultado de uma chamada a mysql_list_dbs().

source: The row parameter is an index into the result set.
pt_br: O parâmetro row é o índice no conjunto de respostas.

source: If an error occurs, FALSE is returned.
pt_br: Se houver um erro é retornado FALSE.

source: Use mysql_errno() and mysql_error() to determine the nature of the error.
pt_br: Use mysql_errno() e mysql_error() para determinar a natureza do erro.

source: Example 1. mysql_db_name() example
pt_br: Exemplo mysql_db_name()

source: For backward compatibility, mysql_dbname() is also accepted.
pt_br: Para compatibilidade com versões anteriores, mysql_dbname() também é aceito.

source: Returns a positive MySQL result resource to the query result, or FALSE on error.
pt_br: Retorna um recurso com o resultado de uma query, ou FALSE se houver erro.

source: The function also returns TRUE / FALSE for INSERT / UPDATE / DELETE queries to indicate success / failure.
pt_br: A função também retorna TRUE / FALSE para as query INSERT / UPDATE / DELETE para indicar sucesso ou falha.

source: mysql_db_query() selects a database and executes a query on it.
pt_br: mysql_db_query() seleciona um banco de dados e executa uma query nele.

source: If the optional link identifier isn' t specified, the function will try to find an open link to the MySQL server and if no such link is found it'll try to create one as if mysql_connect() was called with no arguments.
pt_br: Se o link_identifier não for especificado (é opcional), a função tenterá achar um link aberto para o servidor MySQL, e se nenhum for encontrado, a função tenterá criar um como se a função mysql_connect() fosse chamada sem argumentos.

source: Be aware that this function does NOT switch back to the database you were connected before.
pt_br: Tenha cuidado pois esta função NÃO seleciona de volta o banco de dados que você estava conectado antes.

source: In other words, you can 't use this function to temporarily run a sql query on another database, you would have to manually switch back.
pt_br: Em outras palavras, você não pode usar esta função para executar uma query temporariamente em outro banco de dados, você deve manualmente trocar de volta o banco de dados.

source: Users are strongly encouraged to use the database.table syntax in their sql queries instead of this function.
pt_br: É fortemente recomendado usar a sintaxe database.table nas suas queries ao invés desta função.

source: See also mysql_connect() and mysql_query().
pt_br: Veja também mysql_connect() e mysql_query().

source: This function has been deprecated since PHP 4.0.6.
pt_br: Esta função é obsoleta desde PHP 4.0.6.

source: Do not use this function.
pt_br: Não use esta função.

source: Use mysql_select_db() and mysql_query() instead.
pt_br: Ao invés utilize mysql_select_db() e mysql_query().

source: mysql_drop_db() attempts to drop (remove) an entire database from the server associated with the specified link identifier.
pt_br: mysql_drop_db() tenta remover todo um banco de dados do servidor especificado em link_identifier.

source: For downward compatibility mysql_dropdb() can also be used.
pt_br: Para compatibilidade com as versãoes anteriores, mysql_dropdb() pode ser usada também.

source: The function mysql_drop_db() is deprecated.
pt_br: A função mysql_drop_db() é obsoleta.

source: It is preferable to use mysql_query() to issue a SQL DROP DATABASE statement instead.
pt_br: É preferivel usar mysql_query() ao invés um comando SQL DROP DATABASE.

source: See also: mysql_create_db(), mysql_query().
pt_br: Veja também: mysql_create_db() e mysql_query().

source: Returns the error number from the last MySQL function, or 0 (zero) if no error occurred.
pt_br: Descrição

source: Errors coming back from the MySQL database backend no longer issue warnings.
pt_br: Retorna o número do erro da ultima função do MySQL, ou 0 (zero) se não houve erro.

source: Instead, use mysql_errno() to retrieve the error code.
pt_br: Erros vindos do MySQL não causam avisos.

source: Note that this function only returns the error code from the most recently executed MySQL function (not including mysql_error() and mysql_errno()), so if you want to use it, make sure you check the value before calling another MySQL function.
pt_br: Note que esta função somente retorna o código de erro da ultima função do MySQL que foi executada( não incluindo mysql_error() e mysql_errno()), assim se você quer usa-la, tenha certeza de utiliza-la antes de chamar outra função do MySQL.

source: Example 1. mysql_errno Example
pt_br: Exemplo mysql_errno

source: ?php mysql_connect( "localhost", "mysql_user", "mysql_password"); mysql_select_db("nonexistentdb"); echo mysql_errno(). ":". mysql_error(). "\n"; mysql_select_db("kossu"); mysql_query("SELECT * FROM nonexistenttable"); echo mysql_errno(). ":". mysql_error(). "\n";?
pt_br: ?php mysql_connect( "localhost", "mysql_user", "mysql_password"); mysql_select_db("arquivonaoexistente"); echo mysql_errno(). ":". mysql_error(). "\n"; mysql_select_db("kossu"); mysql_query("SELECT * FROM tabelanaoexistente"); echo mysql_errno(). ":". mysql_error(). "\n";?

source: Unknown database 'nonexistentdb' 1146:
pt_br: Unknown database 'arquivonaoexistente' 1146:

source: Table 'kossu.nonexistenttable' doesn't exist
pt_br: Table 'kossu.tabelanaoexistente' doesn 't exist

source: If the optional argument is specified the given link is used to retrieve the error code.
pt_br: Se o argumento opcional é especificado, a conexão indicada é usada para obter o código de erro.

source: If not, the last opened link is used.
pt_br: Se não, a ultima conexão aberta é usada.

source: See also: mysql_error()
pt_br: Veja também: mysql_error()
